"DOWNGRADE_TITLE" = "已安裝較新版本的 Java。";

"DOWNGRADE_MESSAGE" = "您正在嘗試安裝 %1$@，但是已經安裝 %2$@。\n請造訪 java.com/newerversionexists 瞭解詳細資訊。";

"Restore Security Prompts" = "回復安全提示";

"Browser Plug-in Disabled" = "瀏覽器 Plug-in 已停用";

"Continue" = "繼續";

"Close" = "關閉";

"Install" = "安裝";

"Finish" = "完成";

"You have Successfully Installed %@ \nand the Ask extension(s)." = "您已經順利安裝 %1$@ \n和 Ask 擴充套件。";

"The security level has been set to a minimum value of High." = "安全層次已設為「高」的最小值。";

/* Dynamic welcome string */
"Welcome to the %@ Installer" = "歡迎使用 %1$@ 安裝程式";

/* Dynamic complete string */
"You have successfully installed %@." = "您已順利安裝 %1$@。";

"Information about" = "Oracle Java SE 藍圖重要相關資訊：";

"Oracle has announced" = "即將進行的變更將會對您從 Oracle 存取未來的 Java SE 版本造成影響。";

"Corporate users may" = "公司使用者最快將會在 2019 年 1 月受到影響。";

"and others" = "如需更多的指引，請參閱下面的連結。\n";

"More Information on roadmap" = "關於藍圖的更多資訊";

"Changes are" = "即將進行的變更將會對您從 Oracle 存取未來的 Java SE 版本造成影響。\n\n";

"Corporate users" = "公司使用者將會受到 2019 年 4 月更新的影響。\n\n";

"These changes" = "這些變更不會影響您即將安裝的版本。";

"For additional" = "如需更多的指引，請參閱下面的連結。\n\n";

"More Information..." = "更多資訊...";

"Important Info" = "Oracle Java SE 藍圖重要相關資訊";

"OK" = "確定";

"Java provides" = "Java 為您開啟了一道通往精彩數位內容的大門。從商務解決方案到好用的公用程式與娛樂功能，Java 都能讓您體驗更加生動豐富的網際網路。\n\n";

"Note: No" = "注意: 安裝過程中不會收集任何個人資訊。\n";

/* hyperlink - do not use punctuation */
"Click here" = "按一下此處";

/* Click here for more information on what we do collect. is the full sentence */
" for more" = "以瞭解更多我們所收集的資訊。";

"Click Install" = "按一下「安裝」即表示接受";

"license agreement" = "授權合約";

" and install" = "並立即安裝 Java。";

"Install >" = "安裝 >";

"Please remove" = "請移除過時的 Java 版本";

"The Java software" = "此電腦上的 Java 軟體不是最新版本，未來將不再提供更新。\n\n";

"Keeping out-of-date" = "系統上的 Java 版本若不是最新的，有可能會帶來安全風險。\n\n";

"If you still" = "移除之後，若仍需要 Java 以執行桌面應用程式，請造訪 ";

" for a recommended" = " 以取得建議的版本。";

"Remove" = "移除 >";

"Java Deployment" = "Java 部署快取";

"Java maintains" = "Java 使用快取來加快重新載入常用 Java 程式的速度及儲存追蹤和日誌檔。既然您要移除 Java Runtime，我們建議您一併將此快取移除，以釋出電腦的空間。\n\n深入瞭解 ";

"Java Deployment Cache" = "Java 部署快取";

"Would you like" = "\n\n要移除 Java 快取嗎？(建議移除) \n    ";

"Yes" = "是";

"No" = "否";

"Uninstalled" = "您已經順利移除 Java";

"NoJavaToUninstall" = "未在此系統上偵測到安裝的 Java";

"Complete" = "完成";

"Later" = "稍後";

"Update" = "更新";

"Please remove unused" = "請移除未使用的 Java 版本";

/* It appears that you have not used Java on your system in over 6 months. We recommend that you uninstall it by clicking the Remove button below. */
"It appears that" = "您已經超過 6 個月以上未使用系統上的 Java。建議您解除安裝，方法為按一下下方的";
" Remove" = "移除";
" button below." = "按鈕。";

"If you later" = "之後如果需要使用 Java，請從 java.com 重新安裝。";

/* If you wish to" = "If you wish to keep Java on your system, please update it by clicking the Update button below. */
"If you wish to" = "若想要保留系統上的 Java，請進行更新，方法為按一下";
" Update" = "更新";

"Fail to install" = "無法安裝 Java";

"Uninstalling" = "解除安裝 Java...";

"Fail to uninstall" = "無法解除安裝 Java: %@";

"XPC connection error." = "XPC 連線錯誤。";

"Error code" = "作業系統錯誤碼 %lld。";

"shell is not available." = "無法使用 Shell。";

"process cannot be created." = "無法建立處理作業。";

"Commercial License" = "須有商業授權才能使用此版本";

"Use of this" = "您或您的其中一個軟體提供者必須先取得商業授權後，才能使用這個版本。";

"You can also" = "您也可以使用此版本來執行需搭配 Java Runtime 使用的授權 Oracle 產品。";

"Learn more about this release" = "瞭解此版本的其他資訊";

"Details on the" = "我們所收集資訊的詳細資訊";

"cannot delete" = "無法刪除 Java 部署快取";

"Password prompt" = "%@ 需要權限才能繼續進行作業。";

"Java Update" = "Java 更新";

"OSCHECK_TITLE" = "Oracle 提供的 Java 需要搭配 %1$@ %2$@ 或更新版本。";

"OSCHECK_MESSAGE" = "您的系統已安裝 %1$@ 版本 %2$@。此產品可以安裝在 %3$@ 或更新版本上。\n請造訪 java.com/help 瞭解詳細資訊。";

"Welcome to Java" = "歡迎使用 Java";

"This version" = "此版本的 Java 需有明確授予您使用 Oracle Java SE 產品之 Oracle、授權的 Oracle 合作夥伴或授權的第三方軟體提供者的授權方可使用。您必須自行判斷是否有適當的授權。如果確定擁有授權，請按一下「安裝」以繼續安裝程序。";

"If you have" = "如果您沒有授權，請按一下「移除」以停止安裝程序，然後選擇是否移除較舊的 Java 版本。";

"No personal" = "安裝過程中不會收集任何個人資訊";

"Welcome to Java -" = "歡迎使用 Java - 更新授權條款";

"The terms" = "此版本軟體的授權條款已經變更。";

"Updated License" = "更新授權合約";

"This version -" = "此版本的 Java Runtime 僅授權在個人 (非商業) 桌上型電腦與膝上型電腦上使用。";

"Commercial use" = "若要將此軟體用於商業方面，需要向 Oracle 或軟體廠商取得個別授權。";

"Click install or" = "按一下「安裝」即代表接受授權合約並會立即開始安裝 Java，或按一下「移除」以解除安裝系統上的 Java。";

"Remove -" = "移除";
